In [1]:
import pandas as pd

In [3]:
# 열 이름을 key, 리스트를 value로 갖는 딕셔너리의 정의 (2차원 배열)
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df  = pd.DataFrame(dict_data)
print(type(df))
print(df)

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [16]:
# 리스트에 행 인덱스, 열 이름을 지정하여 데이터 프레임 만들기
df = pd.DataFrame([[15, '남', '신촌중'],[17, '여', '연세중']],
                  index = ['준서', '예은'],
                  columns = ['나이', '성별', '학교'])
# 행 인덱스, 열 인덱스 확인하기
print(df)
print(df.index) # 인덱스 이름
print(df.columns) # 열 이름

    나이 성별   학교
준서  15  남  신촌중
예은  17  여  연세중
Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [17]:
df

    나이 성별   학교
준서  15  남  신촌중
예은  17  여  연세중

In [18]:
df.columns = ['연령', '남여', '소속']
df

    연령 남여   소속
준서  15  남  신촌중
예은  17  여  연세중

In [19]:
df.index = ['학생 1', '학생 2']
df

      연령 남여   소속
학생 1  15  남  신촌중
학생 2  17  여  연세중

In [23]:
# 리스트에 행 인덱스, 열 이름을 지정하여 데이터 프레임 만들기
df = pd.DataFrame([[15, '남', '신촌중'],[17, '여', '연세중']],
                  index = ['준서', '예은'],
                  columns = ['나이', '성별', '학교'])

df.rename(columns = {'나이':'연령', '성별':'남여', '학교':'소속'}, inplace = True)
df.rename(index = {'준서':'학생 1', '예은':'학생 2'}, inplace = True)

In [24]:
df

      연령 남여   소속
학생 1  15  남  신촌중
학생 2  17  여  연세중

In [36]:
# 데이터 프레임 생성
data = {'국어':[80, 90, 70, 30], '영어':[90, 70, 60, 40], '수학':[90, 60, 80, 70]}
df_score = pd.DataFrame(data, index = ['춘향', '몽룡', '향단', '방장'])

df_score

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방장  30  40  70

In [55]:
# 인덱싱으로 몽룡의 국어점수 뽑아보기
df_score['국어'][1:2]

몽룡    90
Name: 국어, dtype: int64

In [76]:
# numpy, random.randint를 사용하여 60~100 사이 12개 숫자를 만들고
# index가 James, maria, brian, alice를 만들고
# 컬럼 이름은 kor, eng, math로 된 데이터 프레임을 생성하기
import  numpy as np

df2 = pd.DataFrame((np.random.randint(60,100,12).reshape(4,3)),
                   index = ['James', 'Maria', 'Brian', 'Alice'],
                   columns = ['Kor', 'Eng', 'Math'])
df2

       Kor  Eng  Math
James   88   78    63
Maria   61   73    95
Brian   63   97    77
Alice   93   73    91

In [84]:
%%writefile sample.csv
c1,c2,c3
1,1.15, one
2,2.23, two
3,3.32, three

Overwriting sample.csv

In [85]:
# 파일로 읽을 때
df = pd.read_csv('sample.csv')
df

   c1    c2      c3
0   1  1.15     one
1   2  2.23     two
2   3  3.32   three

In [86]:
df2 = df[:]

In [89]:
df2.drop(1, inplace = True)  # 1개 행(인덱스) 삭제

C:\Users\tjoeun\AppData\Local\Temp\ipykernel_1108\1338404920.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.drop(1, inplace = True)

In [90]:
df2

   c1    c2      c3
0   1  1.15     one
2   3  3.32   three

In [92]:
df3 = pd.DataFrame((np.random.randint(60,100,12).reshape(4,3)),
                   index = ['James', 'Maria', 'Brian', 'Alice'],
                   columns = ['Kor', 'Eng', 'Math'])
df3

       Kor  Eng  Math
James   72   93    69
Maria   69   60    78
Brian   71   80    61
Alice   66   61    90

In [93]:
# 행 삭제
df3.drop('Brian', inplace = True)  # inplace = True -> 적용
df3

       Kor  Eng  Math
James   72   93    69
Maria   69   60    78
Alice   66   61    90

In [96]:
df3.drop(['James','Alice'], axis=0, inplace=True)  # 여러 행을 지울 때는 axis = 0, inplace = True -> 적용
df3

       Kor  Eng  Math
Maria   69   60    78

In [101]:
df4 = pd.DataFrame((np.random.randint(60,100,16).reshape(4,4)),
                   index = ['James', 'Maria', 'Brian', 'Alice'],
                   columns = ['Kor', 'Eng', 'Math', 'Music'])
df4

       Kor  Eng  Math  Music
James   88   93    76     63
Maria   71   78    62     73
Brian   82   77    63     68
Alice   84   86    71     63

In [110]:
# 복사
df5 = df4.copy()

In [111]:
#열(컬럼) 삭제
df5.drop('Math', axis = 1, inplace=True)
df5

       Kor  Eng  Music
James   88   93     63
Maria   71   78     73
Brian   82   77     68
Alice   84   86     63

In [112]:
df6 = df4.copy()

In [113]:
df6.drop(['Eng', 'Music'], axis = 1, inplace=True)
df6

       Kor  Math
James   88    76
Maria   71    62
Brian   82    63
Alice   84    71

In [114]:
# select row(행) 을 시리즈로 가져옴
# row index를 사용하여 행 1개를 선택
mar1 = df4.loc['Maria'] # loc = location[인덱스 번호]
print(mar1)

Kor      71
Eng      78
Math     62
Music    73
Name: Maria, dtype: int32

In [115]:
# select columns(열) 을 시리즈로 가져옴
# select columns(열) 을 시리즈로 가져옴
mar2 = df4.iloc[0]  # iloc = intger location[인덱스 번호]
print(mar2)

Kor      88
Eng      93
Math     76
Music    63
Name: James, dtype: int32

In [119]:
label = df4.loc[['Brian', 'Alice']]
print(label)

       Kor  Eng  Math  Music
Brian   82   77    63     68
Alice   84   86    71     63

In [120]:
label = df4.iloc[[0,1]]
print(label)

       Kor  Eng  Math  Music
James   88   93    76     63
Maria   71   78    62     73

In [123]:
label2 = df4.iloc[0,1]
print(df4)
print(label2)

       Kor  Eng  Math  Music
James   88   93    76     63
Maria   71   78    62     73
Brian   82   77    63     68
Alice   84   86    71     63
93

In [125]:
# 슬라이싱은 [[A,B]] eotls [A:B]를 사ㅏ용한다, 연속된 값일 경우 범위 지정
label2 = df4.loc[['Maria', 'Brian']]
label3 = df4.loc['Maria':'Brian']

print(label2)
print(label3)

       Kor  Eng  Math  Music
Maria   71   78    62     73
Brian   82   77    63     68
       Kor  Eng  Math  Music
Maria   71   78    62     73
Brian   82   77    63     68

In [130]:
label2 = df4.iloc[[1,3]]
label3 = df4.iloc[1:3]

print(label2)
print(label3)

       Kor  Eng  Math  Music
Maria   71   78    62     73
Alice   84   86    71     63
       Kor  Eng  Math  Music
Maria   71   78    62     73
Brian   82   77    63     68

In [131]:
# select columns
df4

       Kor  Eng  Math  Music
James   88   93    76     63
Maria   71   78    62     73
Brian   82   77    63     68
Alice   84   86    71     63

In [132]:
math1 = df4['Math']
print(type(math1))
print(math1)

<class 'pandas.core.series.Series'>
James    76
Maria    62
Brian    63
Alice    71
Name: Math, dtype: int32

In [135]:
# 영어 columns 1개 선택
eng1 = df4.Eng
print(type(eng1))
print(eng1)

<class 'pandas.core.series.Series'>
James    93
Maria    78
Brian    77
Alice    86
Name: Eng, dtype: int32

In [138]:
# 영어 columns 여러개 선택
math_music = df4[['Math', 'Music']]
print(type(math_music))
print(math_music)

<class 'pandas.core.frame.DataFrame'>
       Math  Music
James    76     63
Maria    62     73
Brian    63     68
Alice    71     63

In [147]:
math2 = df4['Math']   # 시리얼로 반환
math3 = df4[['Math']] # 데이터 프레임으로 반환
print(type(math2))
print(math2)
print(type(math3))
print(math3)

<class 'pandas.core.series.Series'>
James    76
Maria    62
Brian    63
Alice    71
Name: Math, dtype: int32
<class 'pandas.core.frame.DataFrame'>
       Math
James    76
Maria    62
Brian    63
Alice    71

In [148]:
# select elements
df4

       Kor  Eng  Math  Music
James   88   93    76     63
Maria   71   78    62     73
Brian   82   77    63     68
Alice   84   86    71     63

In [156]:
label = df4.loc[['Maria', 'Alice'],['Music', 'Kor']]   # loc[행,열]
print(label)

       Music  Kor
Maria     73   71
Alice     63   84

In [157]:
label = df4.loc[['Maria'],['Eng', 'Math']]   # loc[행,열]
print(label)

       Eng  Math
Maria   78    62

In [159]:
df4.loc['Maria',['Eng', 'Math']]

Eng     78
Math    62
Name: Maria, dtype: int32

In [165]:
df4.iloc[1, 1]

78

In [167]:
df4.iloc[1, 0:4:2]

Kor     71
Math    62
Name: Maria, dtype: int32

In [169]:
df4.iloc[1, [1,2]]

Eng     78
Math    62
Name: Maria, dtype: int32

In [210]:
df4

         Kor  Eng  Math  Music  Gym  Gildong
James     88   93    76     63   90      NaN
Maria     71   78    62     73   90      NaN
Brian     82   77    63     68   90      NaN
Alice     84   86    71     63   90      NaN
4          0    0     0      0    0      NaN
Gildong   90   70    60     75   60      NaN

In [189]:
# james의 영어 수학 음악 점수 가져오기
print(df4.loc['James', 'Eng':'Music'])
print(df4.loc['James', ['Eng','Math','Music']])
print(df4.iloc[0, 1:4])
print(df4.iloc[0, [1,2,3]])

Eng      93
Math     76
Music    63
Name: James, dtype: int32
Eng      93
Math     76
Music    63
Name: James, dtype: int32
Eng      93
Math     76
Music    63
Name: James, dtype: int32
Eng      93
Math     76
Music    63
Name: James, dtype: int32

In [186]:
# 마리아~엘리스 영어~음악까지 loc iloc사용
print(df4.loc['Maria':'Alice', 'Eng':'Music'])
print(df4.iloc[1:4, 1:4])

       Eng  Math  Music
Maria   78    62     73
Brian   77    63     68
Alice   86    71     63
       Eng  Math  Music
Maria   78    62     73
Brian   77    63     68
Alice   86    71     63

In [190]:
# 열 추가 add columns    # 제거 -> drop
df4

       Kor  Eng  Math  Music
James   88   93    76     63
Maria   71   78    62     73
Brian   82   77    63     68
Alice   84   86    71     63

In [191]:
df4['Gym'] = 90  # 없으면 생성 있으면 수정
df4

       Kor  Eng  Math  Music  Gym
James   88   93    76     63   90
Maria   71   78    62     73   90
Brian   82   77    63     68   90
Alice   84   86    71     63   90

In [193]:
# 행 추가 add columns    # 제거 -> drop
df4.loc[4] = 0

       Kor  Eng  Math  Music  Gym
James   88   93    76     63   90
Maria   71   78    62     73   90
Brian   82   77    63     68   90
Alice   84   86    71     63   90
4        0    0     0      0    0

In [214]:
df3.loc['Kim'] = [90, 70 ,60 ,75, 60]
df3

ValueError: cannot set a row with mismatched columns

In [208]:
df4.loc[4] = [90, 70 ,60 ,75, 60]
df4

ValueError: Must have equal len keys and value when setting with an iterable

In [209]:
df4.loc['Gildong'] = [90, 70 ,60 ,75, 60]
df4

ValueError: Must have equal len keys and value when setting with an iterable

In [ ]:
df5 = df4.copy()
df5 = df5.reindex(index=['James', 'Maria', ''])

In [ ]:
# concat ilcc로 행 중간 삽입 concat합수 iloc함수 사용
# pd.concat([df.loc[:n], 원하는 행 , df.iloc[n:]], igore_index=True)

In [217]:
# set_index
exam_data = {'이름':['길동', '철수', '영희'],'수학':[90,80,70],
             '영어':[98,89,95],'음악':[85,95,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  길동  90  98   85  100
1  철수  80  89   95   90
2  영희  70  95  100   90

In [220]:
df.set_index('이름',inplace=True)
print(df)

    수학  영어   음악   체육
이름
길동  90  98   85  100
철수  80  89   95   90
영희  70  95  100   90

In [227]:
# 길동의 체육점수
df.iloc[0][3]
# df.loc['길동','체육']
# df.loc['길동']['체육']

100

In [229]:
# 길동의 체육점수 100점을 90점으로 수정
df.loc['길동','체육'] = 90
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89   95  90
영희  70  95  100  90

In [232]:
# 철수의 음악, 체육을 50점으로 변경
df.loc['길동',['음악', '체육']] = 85, 90
df.loc['철수',['음악', '체육']] = 50
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89   50  50
영희  70  95  100  90

In [237]:
# 철수의 음악, 체육을 100, 50점으로 변경
df.loc['철수',['음악', '체육']] = 100, 50
df

    수학  영어   음악  체육
이름
길동  90  98   85  90
철수  80  89  100  50
영희  70  95  100  90

In [238]:
# 전치 Transpose()
df.transpose()

이름  길동   철수   영희
수학  90   80   70
영어  98   89   95
음악  85  100  100
체육  90   50   90

In [239]:
df.T

이름  길동   철수   영희
수학  90   80   70
영어  98   89   95
음악  85  100  100
체육  90   50   90

In [242]:
# set_index 추가 사용
exam_data = {'이름':['길동', '철수', '영희'],'수학':[90,80,70],
             '영어':[98,89,95],'음악':[85,95,100],'체육':[100,90,90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  길동  90  98   85  100
1  철수  80  89   95   90
2  영희  70  95  100   90

In [246]:
ndf = df.set_index(['이름'])
ndf

    수학  영어   음악   체육
이름
길동  90  98   85  100
철수  80  89   95   90
영희  70  95  100   90

In [248]:
ndf2 = ndf.set_index('음악')
ndf2

     수학  영어   체육
음악
85   90  98  100
95   80  89   90
100  70  95   90

In [249]:
ndf3 = ndf.set_index(['수학', '음악'])
ndf3

        영어   체육
수학 음악
90 85   98  100
80 95   89   90
70 100  95   90

In [250]:
# reindex
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}
df = pd.DataFrame(dict_data, index=['r0', 'r1', 'r2'])
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [254]:
# 인덱스를 새로 지정해서 행 추가
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [258]:
# reindex로 발생한 NaN값을 0으로 채우기
ndf2 = df.reindex(new_index, fill_value=0)
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0

In [260]:
# reset_index
ndf2 = ndf2.reset_index()
ndf2

   level_0 index  c0  c1  c2  c3  c4
0        0    r0   1   4   7  10  13
1        1    r1   2   5   8  11  14
2        2    r2   3   6   9  12  15
3        3    r3   0   0   0   0   0
4        4    r4   0   0   0   0   0

In [264]:
# 내림차순으로 행 인덱스 정렬
ndf2 = ndf2.sort_index(ascending=False)
ndf2

   level_0 index  c0  c1  c2  c3  c4
4        4    r4   0   0   0   0   0
3        3    r3   0   0   0   0   0
2        2    r2   3   6   9  12  15
1        1    r1   2   5   8  11  14
0        0    r0   1   4   7  10  13

In [265]:
# 열을 'c1'기준으로 내림차순으로 정렬
ndf3 = ndf2.sort_values(by='c1', ascending=False)
ndf3

   level_0 index  c0  c1  c2  c3  c4
2        2    r2   3   6   9  12  15
1        1    r1   2   5   8  11  14
0        0    r0   1   4   7  10  13
4        4    r4   0   0   0   0   0
3        3    r3   0   0   0   0   0

In [266]:
# 시리즈 숫자계산
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
print(student1)

국어    100
영어     80
수학     90
dtype: int64

In [269]:
# 과목별로 점수를 200으로 나누기
percentage = student1/200
print(percentage)
print(type(percentage))

국어    0.50
영어    0.40
수학    0.45
dtype: float64
<class 'pandas.core.series.Series'>

In [271]:
student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90, '영어':80})
# 두학생의 과목별 점수 사칙연산
add1 = student1 + student2 # 덧셈
sub1 = student1 - student2 # 뺄셈
mul1 = student1 * student2 # 곱셈
div1 = student1 / student2 # 나눗셈

print(add1, sub1, mul1, div1)

국어    190
수학    170
영어    160
dtype: int64 국어    10
수학    10
영어     0
dtype: int64 국어    9000
수학    7200
영어    6400
dtype: int64 국어    1.111111
수학    1.125000
영어    1.000000
dtype: float64

In [274]:
# 사칙연산 결과를 데이터 프레임으로 합치기 (각 각은 Series -> DataFrame)
result = pd.DataFrame([add1, sub1, mul1, div1], index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

              국어        수학      영어
덧셈    190.000000   170.000   160.0
뺄셈     10.000000    10.000     0.0
곱셈   9000.000000  7200.000  6400.0
나눗셈     1.111111     1.125     1.0

In [276]:
# 결측치가 잇는 경우 사칙연산
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})  # np.nan : 결측치(값이 존재하지 않음)
student2 = pd.Series({'수학':80, '국어':90, '영어':80})

add2 = student1 + student2 # 덧셈
sub2 = student1 - student2 # 뺄셈
mul2 = student1 * student2 # 곱셈
div2 = student1 / student2 # 나눗셈

print(add2, sub2, mul2, div2)

국어      NaN
수학    170.0
영어    160.0
dtype: float64 국어     NaN
수학    10.0
영어     0.0
dtype: float64 국어       NaN
수학    7200.0
영어    6400.0
dtype: float64 국어      NaN
수학    1.125
영어    1.000
dtype: float64

In [277]:
result = pd.DataFrame([add2, sub2, mul2, div2], index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

     국어        수학      영어
덧셈  NaN   170.000   160.0
뺄셈  NaN    10.000     0.0
곱셈  NaN  7200.000  6400.0
나눗셈 NaN     1.125     1.0

In [278]:
# 두 학생의 과목별 점수 사칙연산(연산 메소드 사용)
add3 = student1.add(student2) # 덧셈
sub3 = student1.sub(student2) # 뺄셈
mul3 = student1.mul(student2) # 곱셈
div3 = student1.div(student2) # 나눗셈

print(add3, sub3, mul3, div3)

국어      NaN
수학    170.0
영어    160.0
dtype: float64 국어     NaN
수학    10.0
영어     0.0
dtype: float64 국어       NaN
수학    7200.0
영어    6400.0
dtype: float64 국어      NaN
수학    1.125
영어    1.000
dtype: float64

In [279]:
# 두 학생의 과목별 점수 사칙연산(연산 메소드 사용)
add4 = student1.add(student2, fill_value=0) # 덧셈
sub4 = student1.sub(student2, fill_value=0) # 뺄셈
mul4 = student1.mul(student2, fill_value=0) # 곱셈
div4 = student1.div(student2, fill_value=0) # 나눗셈

print(add4, sub4, mul4, div4)

국어     90.0
수학    170.0
영어    160.0
dtype: float64 국어   -90.0
수학    10.0
영어     0.0
dtype: float64 국어       0.0
수학    7200.0
영어    6400.0
dtype: float64 국어    0.000
수학    1.125
영어    1.000
dtype: float64

In [281]:
import seaborn as sns
# 타이타닉 데이터 셋에서
titanic = sns.load_dataset('titanic')
len(titanic)

891

In [282]:
titanic.head()  # 앞의 5개의 데이터만 추출

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [293]:
df = titanic.loc[:,['age', 'fare']]
df

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]

In [290]:
df.tail()  # 마지막 5행 출력

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

In [292]:
new_df = df+10
new_df

      age     fare
0    32.0  17.2500
1    48.0  81.2833
2    36.0  17.9250
3    45.0  63.1000
4    45.0  18.0500
..    ...      ...
886  37.0  23.0000
887  29.0  40.0000
888   NaN  33.4500
889  36.0  40.0000
890  42.0  17.7500

[891 rows x 2 columns]

In [294]:
# 데이터 프레임 연산
new_df - df

      age  fare
0    10.0  10.0
1    10.0  10.0
2    10.0  10.0
3    10.0  10.0
4    10.0  10.0
..    ...   ...
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

[891 rows x 2 columns]